
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_pubsub_topic.label_topics["Council Data DVR"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_dvr]
google_pubsub_topic.label_topics["Council Data Sales"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_sales]
google_service_account.cloud_run_sa: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/mail-watcher@rising-sector-360922.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_job.gmail_watcher will be created
  + resource "google_cloud_run_v2_job" "gmail_watcher" {
      + conditions               = (known after apply)
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "us-central1"
      + name                     = "gmail-watcher"
      + observed_generation      = (known after apply)
      + project                  = (known after apply)
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + uid                      = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 3
              + service_account       = (known after apply)
              + timeout               = (known after apply)

              + containers {
                  + image = "us-central1-docker.pkg.dev/rising-sector-360922/artifact-registry/gmail-watcher:fa9d116ec90a55fb64c31499ccbc5dcced5ec717"

                  + env {
                      + name  = "force_refresh"
                      + value = "true"
                    }
                  + env {
                      + name  = "labels_to_watch"
                      + value = "council_data_dvr,projects/rising-sector-360922/topics/council_data_dvr,council_data_sales,projects/rising-sector-360922/topics/council_data_sales"
                    }
                }
            }
        }
    }

  # google_service_account.cloud_run_sa must be replaced
-/+ resource "google_service_account" "cloud_run_sa" {
      ~ account_id = "mail-watcher" -> "gmail-watcher" # forces replacement
      ~ email      = "mail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
      ~ id         = "projects/rising-sector-360922/serviceAccounts/mail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
      ~ member     = "serviceAccount:mail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
      ~ name       = "projects/rising-sector-360922/serviceAccounts/mail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
      ~ unique_id  = "108037843464177643271" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Wallace99, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Deploy`*